Revit 2015 API
SolidArray Class
An array that contains solids.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class SolidArray : APIObject, IEnumerable
Visual Basic
Public Class SolidArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class SolidArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.SolidArray
See Also
SolidArray Members
Autodesk.Revit.DB Namespace